app/controllers/categories_controller.rb

  def index
    @categories = current_user.categories.includes(:purchases)
---
SELECT "categories".* FROM "categories" INNER JOIN "categories_users" ON "categories"."id" = "categories_users"."category_id" WHERE "categories_users"."user_id" = $1  [["user_id", 1]]

  def show
    @purchases = @category.purchases.order(created_at: :desc)
---
SELECT "purchases".* FROM "purchases" INNER JOIN "categories_purchases" ON "purchases"."id" = "categories_purchases"."purchase_id" WHERE "categories_purchases"."category_id" = $1 ORDER BY "purchases"."created_at" DESC  [["category_id", 1]]

  def create
    @category = Category.new(category_params)

    if @category.save
---
INSERT INTO "categories" ("name", "icon", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Party"], ["icon", "#<ActionDispatch::Http::UploadedFile:0x0000000115d30c50>"], ["created_at", "2023-12-01 09:44:10.368927"], ["updated_at", "2023-12-01 09:44:10.368927"]]

  def destroy
    @category = Category.find(params[:id])

    # This will delete all purchases associated with this category
    @category.purchases.destroy_all

    @category.destroy
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "categories" WHERE "categories"."id" = $1  [["id", 1]]
DELETE FROM "purchases" WHERE "purchases"."id" = $1  [["id", 1]]
DELETE FROM "categories" WHERE "categories"."id" = $1  [["id", 2]]

  def set_category
    @category = current_user.categories.find(params[:id])
---
SELECT "categories".* FROM "categories" INNER JOIN "categories_users" ON "categories"."id" = "categories_users"."category_id" WHERE "categories_users"."user_id" = $1 AND "categories"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 2], ["LIMIT", 1]]