app/controllers/purchases_controller.rb

    def new
      @category = Category.find(params[:category_id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
      @category = Category.find(params[:category_id])
      @purchase = @category.purchases.build(purchase_params.merge(author: current_user))

      if @purchase.save
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "purchases" ("name", "amount", "author_id", "created_at", "updated_at", "category_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Negroni"], ["amount", "5.0"], ["author_id", 1], ["created_at", "2023-12-02 03:31:28.282015"], ["updated_at", "2023-12-02 03:31:28.282015"], ["category_id", 2]]

    def destroy
      @purchase.destroy
---
DELETE FROM "purchases" WHERE "purchases"."id" = $1  [["id", 4]]

    def set_purchase
      @purchase = Purchase.find(params[:id])
---
SELECT "purchases".* FROM "purchases" WHERE "purchases"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]