app/views/categories/_category.html.erb

SELECT "purchases".* FROM "purchases" WHERE "purchases"."category_id" IN ($1, $2)  [["category_id", 2], ["category_id", 3]]
---
            <p class="category-total">
                <strong>Total: $<%= category.purchases.sum(:amount) %></strong>