app/views/categories/_category.html.erb

SELECT "purchases".* FROM "purchases" WHERE "purchases"."category_id" = $1  [["category_id", 2]]
SELECT SUM("purchases"."amount") FROM "purchases" INNER JOIN "categories_purchases" ON "purchases"."id" = "categories_purchases"."purchase_id" WHERE "categories_purchases"."category_id" = $1  [["category_id", 1]]
---
            <p class="category-total">
                <strong>Total: $<%= category.purchases.sum(:amount) %></strong>